fonecmid-diplom/src/DataProcessors/ВКМ_ВспомогательныеФункции/ВКМ_ВспомогательныеФункции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_ВспомогательныеФункции</name>
</mdclass:DataProcessor>

fonecmid-diplom/src/InformationRegisters/ВКМ_График/ВКМ_График.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_График</name>
  <resources>
    <name>РабочийДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/DataProcessors/ВКМ_ВспомогательныеФункции/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьГрафик(Команда)
	ЗаполнитьГрафикНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьГрафикНаСервере()

	НаборЗаписей = РегистрыСведений.ВКМ_График.СоздатьНаборЗаписей();

	НаборЗаписей.Прочитать();

	ДатаГрафик = Период.ДатаНачала;
	ДопВыходные = ИсключенияВыходные.Выгрузить( , "ДатаВыходной").ВыгрузитьКолонку("ДатаВыходной");
	ДопРабочие = ИсключенияРабочие.Выгрузить( , "ДатаРабочий").ВыгрузитьКолонку("ДатаРабочий");

	Для Индекс = 0 По НаборЗаписей.Количество() - 1 Цикл
		Запись = НаборЗаписей[Индекс];
		Если ДатаГрафик > Запись.Дата Тогда
			Продолжить;
		ИначеЕсли ДатаГрафик = Запись.Дата Тогда
			Если (СтрНайти(ВыходныеПоГрафику, ДеньНедели(ДатаГрафик)) <> 0 Или ДопВыходные.Найти(ДатаГрафик)
				<> Неопределено) И (ДопРабочие.Найти(ДатаГрафик) = Неопределено) Тогда
				Запись.РабочийДень = 0;
			Иначе
				Запись.РабочийДень = 1;
			КонецЕсли;
			ДатаГрафик = ДатаГрафик + 60 * 60 * 24;
		Иначе
			Пока ДатаГрафик < Мин(Запись.Дата, Период.ДатаОкончания) Цикл
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Дата = ДатаГрафик;
				Если (СтрНайти(ВыходныеПоГрафику, ДеньНедели(ДатаГрафик)) <> 0 Или ДопВыходные.Найти(ДатаГрафик)
					<> Неопределено) И (ДопРабочие.Найти(ДатаГрафик) = Неопределено) Тогда
					НоваяЗапись.РабочийДень = 0;
				Иначе
					НоваяЗапись.РабочийДень = 1;
				КонецЕсли;
				ДатаГрафик = ДатаГрафик + 60 * 60 * 24;
			КонецЦикла;
			Если Запись.Дата > Период.ДатаОкончания Тогда
				Прервать;
			Иначе
				Если (СтрНайти(ВыходныеПоГрафику, ДеньНедели(ДатаГрафик)) <> 0 Или ДопВыходные.Найти(ДатаГрафик)
					<> Неопределено) И (ДопРабочие.Найти(ДатаГрафик) = Неопределено) Тогда
					Запись.РабочийДень = 0;
				Иначе
					Запись.РабочийДень = 1;
				КонецЕсли;
				ДатаГрафик = ДатаГрафик + 60 * 60 * 24;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	НаборЗаписей.Записать();

	Пока ДатаГрафик <= Период.ДатаОкончания Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Дата = ДатаГрафик;
		Если (СтрНайти(ВыходныеПоГрафику, ДеньНедели(ДатаГрафик)) <> 0 Или ДопВыходные.Найти(ДатаГрафик)
			<> Неопределено) И (ДопРабочие.Найти(ДатаГрафик) = Неопределено) Тогда
			НоваяЗапись.РабочийДень = 0;
		Иначе
			НоваяЗапись.РабочийДень = 1;
		КонецЕсли;
		ДатаГрафик = ДатаГрафик + 60 * 60 * 24;
	КонецЦикла;
	НаборЗаписей.Записать();

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = СтрШаблон("График за %1 заполнен", Период);
	Сообщение.Сообщить();

КонецПроцедуры

#КонецОбласти
